{"weightsManifest": [{"weights": [{"dtype": "float32", "shape": [5, 5, 1, 32], "name": "conv2d_1/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv2d_1/bias"}, {"dtype": "float32", "shape": [5, 5, 32, 32], "name": "conv2d_2/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv2d_2/bias"}, {"dtype": "float32", "shape": [3, 3, 32, 64], "name": "conv2d_3/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_3/bias"}, {"dtype": "float32", "shape": [3, 3, 64, 64], "name": "conv2d_4/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_4/bias"}, {"dtype": "float32", "shape": [3136, 256], "name": "dense_1/kernel"}, {"dtype": "float32", "shape": [256], "name": "dense_1/bias"}, {"dtype": "float32", "shape": [256, 10], "name": "dense_2/kernel"}, {"dtype": "float32", "shape": [10], "name": "dense_2/bias"}], "paths": ["group1-shard1of1"]}], "modelTopology": {"keras_version": "2.1.6", "training_config": {"optimizer_config": {"class_name": "RMSprop", "config": {"lr": 6.25000029685907e-05, "decay": 0.0, "rho": 0.8999999761581421, "epsilon": 1e-08}}, "loss": "categorical_crossentropy", "metrics": ["accuracy"], "loss_weights": null, "sample_weight_mode": null}, "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"filters": 32, "use_bias": true, "kernel_size": [5, 5], "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "batch_input_shape": [null, 28, 28, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "name": "conv2d_1", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "activation": "relu", "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_constraint": null}}, {"class_name": "Conv2D", "config": {"filters": 32, "use_bias": true, "kernel_size": [5, 5], "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "name": "conv2d_2", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "padding": "same", "kernel_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_1", "data_format": "channels_last", "padding": "valid", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "name": "dropout_1", "noise_shape": null, "rate": 0.25}}, {"class_name": "Conv2D", "config": {"filters": 64, "use_bias": true, "kernel_size": [3, 3], "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "name": "conv2d_3", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "padding": "same", "kernel_constraint": null}}, {"class_name": "Conv2D", "config": {"filters": 64, "use_bias": true, "kernel_size": [3, 3], "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "name": "conv2d_4", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "padding": "same", "kernel_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_2", "data_format": "channels_last", "padding": "valid", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "name": "dropout_2", "noise_shape": null, "rate": 0.25}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"units": 256, "activation": "relu", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": true, "activity_regularizer": null, "trainable": true, "name": "dense_1", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "name": "dropout_3", "noise_shape": null, "rate": 0.5}}, {"class_name": "Dense", "config": {"units": 10, "activation": "softmax", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": true, "activity_regularizer": null, "trainable": true, "name": "dense_2", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null}}]}}}