{"modelTopology": {"keras_version": "2.0.4", "model_config": {"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"activity_regularizer": null, "data_format": "channels_last", "dtype": "float32", "kernel_size": [3, 3], "activation": "relu", "name": "conv2d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "filters": 32, "padding": "valid", "batch_input_shape": [null, 28, 28, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "strides": [1, 1], "bias_regularizer": null}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "data_format": "channels_last", "filters": 64, "kernel_size": [3, 3], "activation": "relu", "name": "conv2d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "kernel_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "name": "max_pooling2d_1"}}, {"class_name": "Dropout", "config": {"rate": 0.25, "trainable": true, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "trainable": true, "kernel_constraint": null, "units": 128, "bias_constraint": null, "kernel_regularizer": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "trainable": true, "kernel_constraint": null, "units": 10, "bias_constraint": null, "kernel_regularizer": null, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null}}]}, "backend": "tensorflow", "training_config": {"loss_weights": null, "metrics": ["accuracy"], "sample_weight_mode": null, "loss": "categorical_crossentropy", "optimizer_config": {"class_name": "Adadelta", "config": {"epsilon": 1e-08, "decay": 0.0, "lr": 1.0, "rho": 0.95}}}}, "weightsManifest": [{"weights": [{"dtype": "float32", "name": "conv2d_1/kernel", "shape": [3, 3, 1, 32]}, {"dtype": "float32", "name": "conv2d_1/bias", "shape": [32]}, {"dtype": "float32", "name": "conv2d_2/kernel", "shape": [3, 3, 32, 64]}, {"dtype": "float32", "name": "conv2d_2/bias", "shape": [64]}, {"dtype": "float32", "name": "dense_1/kernel", "shape": [9216, 128]}, {"dtype": "float32", "name": "dense_1/bias", "shape": [128]}, {"dtype": "float32", "name": "dense_2/kernel", "shape": [128, 10]}, {"dtype": "float32", "name": "dense_2/bias", "shape": [10]}], "paths": ["group1-shard1of2", "group1-shard2of2"]}]}