{"weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"dtype": "float32", "name": "conv2d_1/kernel", "shape": [5, 5, 1, 32]}, {"dtype": "float32", "name": "conv2d_1/bias", "shape": [32]}, {"dtype": "float32", "name": "conv2d_2/kernel", "shape": [5, 5, 32, 32]}, {"dtype": "float32", "name": "conv2d_2/bias", "shape": [32]}, {"dtype": "float32", "name": "conv2d_3/kernel", "shape": [3, 3, 32, 64]}, {"dtype": "float32", "name": "conv2d_3/bias", "shape": [64]}, {"dtype": "float32", "name": "conv2d_4/kernel", "shape": [3, 3, 64, 64]}, {"dtype": "float32", "name": "conv2d_4/bias", "shape": [64]}, {"dtype": "float32", "name": "dense_1/kernel", "shape": [3136, 256]}, {"dtype": "float32", "name": "dense_1/bias", "shape": [256]}, {"dtype": "float32", "name": "dense_2/kernel", "shape": [256, 10]}, {"dtype": "float32", "name": "dense_2/bias", "shape": [10]}]}], "modelTopology": null}